xmlsamples/PI_MTCN/KW-SMV-AIS.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:send-money-validation-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <device>
            <id>GF</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>UAE Exchange</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>KIRAN</first_name>
               <middle_name/>
               <last_name>JOHN</last_name>
            </name>
            <address>
               <addr_line1>TESTSPECIASDFSDF, DFSDF</addr_line1>
               <city>FARWANIYA</city>
               <country_code>
                  <iso_code>
                     <country_code>KW</country_code>
                     <currency_code>KWD</currency_code>
                  </iso_code>
                  <country_name>KUWAIT</country_name>
               </country_code>
            </address>
            <preferred_customer>
               <permanent_change>None</permanent_change>
               <mywu_number/>
            </preferred_customer>
            <compliance_details>
               <template_id>KWT_01_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>CHINA</id_country_of_issue>
                  <id_number>G12648267</id_number>
               </id_details>
               <third_party_details>
                  <flag_pay>N</flag_pay>
               </third_party_details>
               <id_issue_date>04042007</id_issue_date>
               <id_expiration_date>18042029</id_expiration_date>
               <date_of_birth>01041993</date_of_birth>
               <occupation>Professional nurse</occupation>
               <transaction_reason>Educational fees</transaction_reason>
               <Country_of_Birth>India</Country_of_Birth>
               <nationality>India</nationality>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
            </compliance_details>
            <email/>
            <phone_country_code>965</phone_country_code>
            <contact_phone>99352709</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>965</country_code>
                  <national_number>99352709</national_number>
               </phone_number>
            </mobile_phone>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>Sai</first_name>
               <middle_name/>
               <last_name>vishnu</last_name>
            </name>
            <address>
               <addr_line1>telengana</addr_line1>
               <addr_line2/>
               <city>HYD</city>
               <state>telengana</state>
            </address>
            <mobile_phone>
               <phone_number>
                  <country_code>880</country_code>
                  <national_number>1234567890</national_number>
               </phone_number>
            </mobile_phone>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>KW</country_code>
                  <currency_code>KWD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>BD</country_code>
                  <currency_code>BDT</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>KW</country_code>
                  <currency_code>KWD</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <fix_on_send>N</fix_on_send>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <originators_principal_amount>34200</originators_principal_amount>
            <destination_principal_amount>0</destination_principal_amount>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHKW0920T</identifier>
            <reference_no>TEST1234456789</reference_no>
            <counter_id>KW092PP0001A</counter_id>
         </foreign_remote_system>
      </ns2:send-money-validation-request>
   </soap:Body>
</soap:Envelope>