xmlsamples/PI_MTCN/PH-SMV-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-validation-request>
         <device>
            <id>GF</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>PETNET</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>Roop</first_name>
               <last_name>Sundar</last_name>
            </name>
            <address>
               <addr_line1>AECS layout</addr_line1>
               <city>Navotas</city>
               <state>METRO MANILA</state>
               <postal_code>899934</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>PH</country_code>
                     <currency_code>PHP</currency_code>
                  </iso_code>
                  <country_name>PHILIPPINES</country_name>
               </country_code>
            </address>
            <preferred_customer>
               <account_nbr>947A09122</account_nbr>
            </preferred_customer>
            <compliance_details>
               <template_id>UNI_01_S</template_id>
               <version>PH_1.1</version>
               <id_details>
                  <id_type>B</id_type>
                  <id_country_of_issue>PHILIPPINES</id_country_of_issue>
                  <id_number>426179840435</id_number>
               </id_details>
               <third_party_details>
                  <flag_pay>N</flag_pay>
               </third_party_details>
               <id_issue_date>10102010</id_issue_date>
               <id_expiration_date>11112025</id_expiration_date>
               <date_of_birth>18031995</date_of_birth>
               <occupation>Prof Svc Practitioner</occupation>
               <transaction_reason>Education/School Fee</transaction_reason>
               <Current_address>
                  <addr_line1>10th Street</addr_line1>
                  <city>Manilla</city>
                  <state_name>Manilla</state_name>
                  <!--<postal_code>825401</postal_code>-->
                  <country>PHILIPPINES</country>
               </Current_address>
               <contact_phone>9876541230</contact_phone>
               <Country_of_Birth>PHILIPPINES</Country_of_Birth>
               <nationality>PHILIPPINES</nationality>
               <Gender>M</Gender>
               <Location>Maniilla</Location>
               <Source_of_Funds>Salary</Source_of_Funds>
               <Relationship_to_Receiver_Sender>Family</Relationship_to_Receiver_Sender>
               <Does_the_ID_have_an_expiration_date>N</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
               <Country_Code>608</Country_Code>
               <does_the_ID_have_an_issue_date>Y</does_the_ID_have_an_issue_date>
               <employment_position_level>Mid-Level/Supervisory/Management</employment_position_level>
            </compliance_details>
            <email>roop@sbb.com</email>
            <contact_phone>7406366171</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>63</country_code>
                  <national_number>7406366171</national_number>
               </phone_number>
            </mobile_phone>
            <sms_notification_flag>Y</sms_notification_flag>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>Praveena</first_name>
               <last_name>Lakshmi</last_name>
            </name>
            <sms_notification_flag>Y</sms_notification_flag>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>1.0000000</exchange_rate>
            <duplicate_detection_flag>O</duplicate_detection_flag>
         </payment_details>
         <financials>
            <originators_principal_amount>100</originators_principal_amount>
            <destination_principal_amount>100</destination_principal_amount>
            <gross_total_amount>8650</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <pay_amount>100</pay_amount>
            <charges>50</charges>
            <tolls>8500</tolls>
            <canadian_dollar_exchange_fee>0</canadian_dollar_exchange_fee>
            <message_charge>8500</message_charge>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHPH6470T</identifier>
            <reference_no>001</reference_no>
            <counter_id>PH647TT0002</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-validation-request>
   </soapenv:Body>
</soapenv:Envelope>